
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/8344475218)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * google_project_iam_member.telegram-sa-roles[&#34;roles/run.invoker&#34;]
  * google_project_iam_member.telegram-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]
  * google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_allowed_domains&#34;]
  * google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_bot_token&#34;]
  * google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_webhook_user_id&#34;]
  * google_service_account.telegram-sa
* Delete
  * google_secret_manager_secret.frontend-secrets[&#34;environment&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_target_backend&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_telegram_bot_token&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_telegram_webhook_path_base&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_telegram_webhook_url&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_telegram_webhook_user_id&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.telegram-sa-roles["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "telegram-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.telegram-sa-roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "telegram-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_secret_manager_secret.frontend-secrets["environment"] will be destroyed
  # (because key ["environment"] is not in for_each map)
  - resource "google_secret_manager_secret" "frontend-secrets" {
      - annotations           = {} -> null
      - create_time           = "2024-02-16T13:51:09.281479Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/environment" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/environment" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "environment" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_target_backend"] will be destroyed
  # (because key ["proxy_target_backend"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-08T00:07:53.652484Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_target_backend" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_target_backend" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_target_backend" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_bot_token"] will be destroyed
  # (because key ["proxy_telegram_bot_token"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-17T14:06:12.334819Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_bot_token" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_bot_token" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_bot_token" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_path_base"] will be destroyed
  # (because key ["proxy_telegram_webhook_path_base"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-18T02:43:36.937017Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_webhook_path_base" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_webhook_path_base" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_webhook_path_base" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_url"] will be destroyed
  # (because key ["proxy_telegram_webhook_url"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-17T23:14:27.130244Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_webhook_url" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_webhook_url" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_webhook_url" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_user_id"] will be destroyed
  # (because key ["proxy_telegram_webhook_user_id"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-18T02:43:36.932595Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_webhook_user_id" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_webhook_user_id" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_webhook_user_id" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_allowed_domains"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_allowed_domains"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_bot_token"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_bot_token"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_webhook_user_id"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_webhook_user_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_service_account.telegram-sa will be created
  + resource "google_service_account" "telegram-sa" {
      + account_id   = "telegram-sa"
      + disabled     = false
      + display_name = "telegram-sa"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gig-japan-398904"
      + unique_id    = (known after apply)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":183,"Program":"tfcmt","SHA1":"9e2c108f9aa68bae354da7f6c3cb75e693729ef8","Vars":{},"WorkflowName":"iaac_plan"} -->